---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewportViewName
source: html/dbe9adda-919d-0108-71ab-3f298523d083.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewportViewName Property

"View Name"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewportViewName { get; }
```